app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "hello"], ["email", "hello@test.com"], ["password", "hellothere"], ["created_at", "2020-10-06 17:22:23.421223"], ["updated_at", "2020-10-06 17:22:23.421223"]]
---
  def create
    @user = User.new(user_params)
    if @user.save